Revit 2027 API
KeyBasedTreeEntriesLoadContent.CanAddEntry Method
 Verifies if the KeyBasedTreeEntry could be added in this KeyBasedTreeEntriesLoadContent.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanAddEntry(
	KeyBasedTreeEntry entry
)
Public Function CanAddEntry (
	entry As KeyBasedTreeEntry
) As Boolean
public:
bool CanAddEntry(
	KeyBasedTreeEntry^ entry
)
member CanAddEntry :
        entry : KeyBasedTreeEntry -> bool
Parameters
entry KeyBasedTreeEntry
 The KeyBasedTreeEntry object to be checked.
Return Value
Boolean
 True if the KeyBasedTreeEntry could be added in, otherwise false.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
KeyBasedTreeEntriesLoadContent Class
Autodesk.Revit.DB Namespace